// Задача 60. ...Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.
int[,,] arr = new int[,,]{
    {
        {13, 20},
        {53, 17},
    },
    {
        {43, 30},
        {93, 67},
    }
};

for (int i = 0; i < arr.GetLength(0); i++)
    for (int j = 0; j < arr.GetLength(1); j++)
    {
        for (int k = 0; k < arr.GetLength(2); k++)
            Console.Write($"{arr[i, j, k]}({i},{j},{k}) ");
        Console.WriteLine();
    }

/*
asukhodko@MBP-Aleksandr task-60 % dotnet run
13(0,0,0) 20(0,0,1) 
53(0,1,0) 17(0,1,1) 
43(1,0,0) 30(1,0,1) 
93(1,1,0) 67(1,1,1) 
*/
